Revit 2027 API
FamilyItemFactory.NewSweptBlend Method
Adds a new swept blend into the family document.
Overload List
Name | Description
NewSweptBlend(Boolean, Reference, SweepProfile, SweepProfile) | Adds a new swept blend into the family document, using a selected reference as the path.
NewSweptBlend(Boolean, Curve, SketchPlane, SweepProfile, SweepProfile) | Add a new swept blend into the family document, using a curve as the path.
Top
See Also
Reference
FamilyItemFactory Class
Autodesk.Revit.Creation Namespace